In [18]:
import pandas as pd
list=[[1,2,3,4],['a','b','c','d'],['a1','a2','a3','a4']]
list1=[1,2,3,4]
list2=['a','b','c','d']
list3=['a1','a2','a3','a4']
#list
ab=pd.DataFrame(list,columns = ['a','b','c' , 'd'])
print(ab.shape)
ab

(3, 4)

    a   b   c   d
0   1   2   3   4
1   a   b   c   d
2  a1  a2  a3  a4

In [19]:
stu_record={"name":['aman','gaman','raman','parry','harry','gaman','ankur'],'id':[1,2,3,4,5,6,6],'roll_no':[12,13,14,15,16,13,18],'cl':['btech','btech','btech','btech','mtech','btech','ctech']}
df=pd.DataFrame(stu_record  ,  columns=['id','name','roll_no','cl'])
print (df)

   id   name  roll_no     cl
0   1   aman       12  btech
1   2  gaman       13  btech
2   3  raman       14  btech
3   4  parry       15  btech
4   5  harry       16  mtech
5   6  gaman       13  btech
6   6  ankur       18  ctech

In [20]:
df.index=range(1,8)
print (df)

   id   name  roll_no     cl
1   1   aman       12  btech
2   2  gaman       13  btech
3   3  raman       14  btech
4   4  parry       15  btech
5   5  harry       16  mtech
6   6  gaman       13  btech
7   6  ankur       18  ctech

In [21]:
df.columns=['id','name','roll_no','cl']
print(df)

   id   name  roll_no     cl
1   1   aman       12  btech
2   2  gaman       13  btech
3   3  raman       14  btech
4   4  parry       15  btech
5   5  harry       16  mtech
6   6  gaman       13  btech
7   6  ankur       18  ctech

In [22]:
df.drop('cl',axis=1)

   id   name  roll_no
1   1   aman       12
2   2  gaman       13
3   3  raman       14
4   4  parry       15
5   5  harry       16
6   6  gaman       13
7   6  ankur       18

In [23]:
df.drop(df.columns[1],axis=1)

   id  roll_no     cl
1   1       12  btech
2   2       13  btech
3   3       14  btech
4   4       15  btech
5   5       16  mtech
6   6       13  btech
7   6       18  ctech

In [24]:
#del stu_record['roll no']
#print(stu_record)

In [25]:
#df.drop(5)

In [26]:
df.drop_duplicates()#for row operation

   id   name  roll_no     cl
1   1   aman       12  btech
2   2  gaman       13  btech
3   3  raman       14  btech
4   4  parry       15  btech
5   5  harry       16  mtech
6   6  gaman       13  btech
7   6  ankur       18  ctech

In [27]:
df.drop_duplicates(['id'],keep='last')

   id   name  roll_no     cl
1   1   aman       12  btech
2   2  gaman       13  btech
3   3  raman       14  btech
4   4  parry       15  btech
5   5  harry       16  mtech
7   6  ankur       18  ctech

In [28]:
c_series =df.groupby('cl')['name'].count()       # for series count
print (c_series)

cl
btech    5
ctech    1
mtech    1
Name: name, dtype: int64

In [29]:
c_df =df.groupby('cl')[['name']].count()       # for dataframe
print (c_df)

       name
cl
btech     5
ctech     1
mtech     1

In [30]:
cseries =df.groupby('cl')['name']
for i,j in cseries :
    print(i)
    print(j)

btech
1     aman
2    gaman
3    raman
4    parry
6    gaman
Name: name, dtype: object
ctech
7    ankur
Name: name, dtype: object
mtech
5    harry
Name: name, dtype: object

In [33]:
cd =df.groupby('cl')[['name']]
for f,g in cd :
    print(f)
    print(g)
cd.drop('id',axis=1)

btech
   id   name  roll_no     cl
1   1   aman       12  btech
2   2  gaman       13  btech
3   3  raman       14  btech
4   4  parry       15  btech
6   6  gaman       13  btech
ctech
   id   name  roll_no     cl
7   6  ankur       18  ctech
mtech
   id   name  roll_no     cl
5   5  harry       16  mtech

AttributeError: Cannot access callable attribute 'drop' of 'DataFrameGroupBy' objects, try using the 'apply' method

In [32]:
df[(df.id>4)  & (df.roll_no>16)]


df.query('id>4' & 'cl=="btech"')

TypeError: unsupported operand type(s) for &: 'str' and 'str'

In [36]:
import pandas as pd
import numpy as np
df = pd.DataFrame( {
"Name" : ["Aman", "Anita", "Rohan", "Joe", "Neha" , "Karthik"] ,
"City" : ["Chandigarh", "Kaithal", "Kaithal", "Jalandhar", "Delhi", "Delhi"],
"Employed":["yes","yes","no","yes","yes","no"]} )
g_by = df.groupby("City")["Name"]
for a, b in g_by: ##this used for read data after group single column
    print(a)
    print(b)
g_by.get_group('Delhi')

Chandigarh
0    Aman
Name: Name, dtype: object
Delhi
4       Neha
5    Karthik
Name: Name, dtype: object
Jalandhar
3    Joe
Name: Name, dtype: object
Kaithal
1    Anita
2    Rohan
Name: Name, dtype: object

4       Neha
5    Karthik
Name: Name, dtype: object